In [1]:
from ml1m_dataset import Ml1mDataset 

#INFO: unit test & EDA

data_X, data_y = Ml1mDataset().load_ml1m()
print(data_X.shape)
print(data_y.shape)

(1000209, 9)
(1000209, 1)

In [2]:
## EDA

data_X.head()

,user_id,item_id,timestamp,title,genres,gender,age,occupation,zip
0,1,1193,978300760,One Flew Over the Cuckoo's Nest (1975),Drama,F,1,10,48067
1,1,661,978302109,James and the Giant Peach (1996),Animation|Children's|Musical,F,1,10,48067
2,1,914,978301968,My Fair Lady (1964),Musical|Romance,F,1,10,48067
3,1,3408,978300275,Erin Brockovich (2000),Drama,F,1,10,48067
4,1,2355,978824291,"Bug's Life, A (1998)",Animation|Children's|Comedy,F,1,10,48067

In [3]:
data_X.describe()

            user_id       item_id     timestamp           age    occupation
count  1.000209e+06  1.000209e+06  1.000209e+06  1.000209e+06  1.000209e+06
mean   3.024512e+03  1.865540e+03  9.722437e+08  2.973831e+01  8.036138e+00
std    1.728413e+03  1.096041e+03  1.215256e+07  1.175198e+01  6.531336e+00
min    1.000000e+00  1.000000e+00  9.567039e+08  1.000000e+00  0.000000e+00
25%    1.506000e+03  1.030000e+03  9.653026e+08  2.500000e+01  2.000000e+00
50%    3.070000e+03  1.835000e+03  9.730180e+08  2.500000e+01  7.000000e+00
75%    4.476000e+03  2.770000e+03  9.752209e+08  3.500000e+01  1.400000e+01
max    6.040000e+03  3.952000e+03  1.046455e+09  5.600000e+01  2.000000e+01

In [4]:
data_X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000209 entries, 0 to 1000208
Data columns (total 9 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   user_id     1000209 non-null  int64
 1   item_id     1000209 non-null  int64
 2   timestamp   1000209 non-null  int64
 3   title       1000209 non-null  object
 4   genres      1000209 non-null  object
 5   gender      1000209 non-null  object
 6   age         1000209 non-null  int64
 7   occupation  1000209 non-null  int64
 8   zip         1000209 non-null  object
dtypes: int64(5), object(4)
memory usage: 68.7+ MB

In [5]:
data_y.head()

   rating
0       5
1       3
2       3
3       4
4       5

In [2]:
data_y.shape

(1000209, 1)

In [6]:
data_y.describe()

             rating
count  1.000209e+06
mean   3.581564e+00
std    1.117102e+00
min    1.000000e+00
25%    3.000000e+00
50%    4.000000e+00
75%    4.000000e+00
max    5.000000e+00

In [7]:
data_y.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000209 entries, 0 to 1000208
Data columns (total 1 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   rating  1000209 non-null  int64
dtypes: int64(1)
memory usage: 7.6 MB